{
   "name": "Chocolate Cream Squares",
   "author": "Dana Gallagher",
   "category": 6,
   "ingredients": [
      {
         "amount": 0.5,
         "name": "lb. bittersweet chocolate, cut into 1/2 inch pieces (cake)"
      },
      {
         "amount": 2,
         "name": "tsp instant espresso powder dissolved in 1/3 cup hot water (cake)"
      },
      {
         "amount": 6,
         "name": "large eggs, seperated (cake)"
      },
      {
         "amount": 0.66,
         "name": "c. sugar (cake)"
      },
      {
         "amount": 2,
         "name": "tsp pure vanilla extract (cake)"
      },
      {
         "amount": 0.25,
         "name": "tsp cream of tartar (cake)"
      },
      {
         "amount": 0,
         "name": "pinch of salt (cake)"
      },
      {
         "amount": 0.25,
         "name": "c. all-purpose flour (cake)"
      },
      {
         "amount": 0,
         "name": "Unsweetened cocoa powder, for dusting (cake)"
      },
      {
         "amount": 6,
         "name": "oz. bittersweet chocolate, cut into 1/2 inch pieces (filling)"
      },
      {
         "amount": 2,
         "name": "tbl unsalted butter (filling)"
      },
      {
         "amount": 2,
         "name": "tbl water (filling)"
      },
      {
         "amount": 1.5,
         "name": "cups heavy cream (filling)"
      },
      {
         "amount": 3,
         "name": "tbl confectioners' sugar (filling)"
      },
      {
         "amount": 1,
         "name": "tsp pure vanilla extract (filling)"
      },
      {
         "amount": 1,
         "name": "tbl solid vegetable shortening (glaze)"
      },
      {
         "amount": 0.25,
         "name": "cup granulated sugar (glaze)"
      },
      {
         "amount": 0.33,
         "name": "cup water (glaze)"
      },
      {
         "amount": 4,
         "name": "oz. bittersweet chocolate, cut into 1/2 inch pieces (glaze)"
      },
      {
         "amount": 1,
         "name": "oz unsweetened chocalted, finely chopped (glaze)"
      },
      {
         "amount": 1,
         "name": "tsp pur vanilla extract (glaze)"
      }
   ],
   "instructions": "This super-rich dessert contains chocolate whipped cream between layers of bittersweet chocolate cake topped with a fudgy chocolate glaze. It's best made one \n\nActive: 1 hr \nTotal: 8 hrs \n\nStep 1\nPreheat the oven to 375°. Butter an 18-by-12-inch large rimmed baking sheet and line the bottom with parchment or wax paper. Butter the paper and dust with flour, tapping out any excess. In a small saucepan, combine the chocolate with the dissolved espresso and cook over low heat, stirring constantly, until melted, about 2 minutes. Let cool slightly.\n\nStep 2\nIn a medium bowl, using an electric mixer, beat the egg yolks at high speed until pale, 2 to 3 minutes. At medium speed, gradually beat in 1/3 cup of the sugar. Increase the speed to high and beat until very thick and pale, about 5 minutes. Add the vanilla and the chocolate mixture and beat at low speed until blended.\n\nStep 3\nIn a large bowl, using clean beaters, beat the egg whites with the cream of tartar and salt until soft peaks form. Gradually add the remaining 1/3 cup of sugar and beat at high speed until the whites are stiff and glossy. Using a large rubber spatula, fold the chocolate mixture and the flour into the whites in 2 batches, until no streaks remain. Spread the batter evenly in the prepared baking sheet. Bake for 12 minutes, or until the cake has risen and is slightly springy. Transfer to a rack and let cool.\n\nStep 4\nRun the tip of a knife around the cake and sift cocoa over the surface. Cover the cake with wax paper and top with a cutting board. Invert the cake onto the cutting board. Lift off the pan and peel off the paper. Cut the cake in half crosswise, forming 2 rectangles. Chill until firm, about 30 minutes.\n\nStep 5\nIn a small saucepan, combine the chocolate with the butter and water. Cook over very low heat, stirring constantly, until melted and shiny. Scrape into a bowl and let cool. Using an electric mixer, beat the cream with the confectioners' sugar and vanilla until firm. Using a rubber spatula, fold in the cooled chocolate.\n\nStep 6\nIn a small saucepan, combine the shortening with the granulated sugar and water and bring to a simmer. Off the heat, add the bittersweet and unsweetened chocolate and let stand until melted, 2 minutes. Whisk in the vanilla. Let the glaze cool until slightly thickened, about 30 minutes.\n\nStep 7\nSpread the cream filling over one half of the cake and top with the other half, cocoa side up. Press down lightly and run a cake spatula all around to smooth the edges. Pour the glaze down the center of the cake and gently spread it so that it covers the top and drizzles down the sides. Freeze the cake for 4 hours or overnight. Let stand at room temperature until just soft enough to cut. Cut the cake into 3 long strips, then cut each strip into 6 squares. Transfer to plates and serve.\n\nMake Ahead\nThe cake can be frozen for 1 week.",
   "yield": {
      "amount": 18,
      "name": "squares"
   }
}
