{
   "name": "Molten Center Chocolate Cake",
   "author": "Sara Snider",
   "category": 6,
   "ingredients": [
      {
         "amount": 4,
         "name": "oz your favorite bittersweet chocolate"
      },
      {
         "amount": 4,
         "name": "oz unsalted butter"
      },
      {
         "amount": 2,
         "name": "egg yolks"
      },
      {
         "amount": 2,
         "name": "eggs"
      },
      {
         "amount": 1,
         "name": "tsp vanilla extract"
      },
      {
         "amount": 4,
         "name": "tbsp granulated sugar"
      },
      {
         "amount": 1,
         "name": "pinch sea salt"
      },
      {
         "amount": 4,
         "name": "tbsp cake flour (sifted)"
      }
   ],
   "instructions": "1) These cakes can be made the day before and stored in the refrigerator, ready to bake. Preheat oven to 406 degrees F.\n2) Prepare baking dishes by liberally spreading + srature butler into four 4-ounce molds of round soufflé dishes, or spray 4-ounce molds with pan spray.\n3) Melt together chocolate and butter in a medium saucepan until melted and smooth, stirring constantly\n4) In a separate bowl, whisk together egg yolks, eggs, veniila, sugar, and salt. Whisk in melted chocolate mixture. Sprinkle sifted flour over the mixture and fold in. Pour batter into each of the prepared dishes\n5) Bake 20 to 30 minutes (longe rfor refrigerated batter), checking halfway through the cooking time. The Cake batter shuld rise above the sides of the dished and the top edges should be dark brown in color. Remove from the oven while the centers are still soft and gooey.\n6) Using a paring knife, run around the sides of the dish to loosen the cakes. Allow cakes to cool at room temperature for 5 minutes.\n7) To plate: Place your dessert plate atop one of the cake dished. Using oven mitts or a dish towel, hold the plate and the dish together and invert\n8) Serve immediately with fresh Pontchatoula Strawberries and freshly whipped and lightly sweetened whipped cream or créme fraiche",
   "yield": {
      "amount": 4,
      "name": "4-oz cakes"
   }
}
