{
   "name": "Pineapple Upside Down Cheesecake (Sara's Version)",
   "author": "Sara Snider",
   "category": 6,
   "ingredients": [
	  {
         "amount": 1.5,
         "name": "cup crushed graham crackers (cheesecake)"
      },
      {
         "amount": 0.25,
         "name": "cup melted butter (cheesecake)"
      },
      {
         "amount": 0.25,
         "name": "cup sugar (cheesecake)"
      },
      {
         "amount": 4,
         "name": "(8oz) packages cream cheese (cheesecake)"
      },
      {
         "amount": 1.5,
         "name": "cup white sugar (cheesecake)"
      },
      {
         "amount": 0.75,
         "name": "cup milk (cheesecake)"
      },
      {
         "amount": 4,
         "name": "eggs (cheesecake)"
      },
      {
         "amount": 1,
         "name": "cup sour cream (cheesecake)"
      },
      {
         "amount": 1,
         "name": "TBL vanilla extract (cheesecake)"
      },
      {
         "amount": 3,
         "name": "TBL flour (cheesecake)"
      },
      {
         "amount": 0.25,
         "name": "cup salted butter melted (topping)"
      },
      {
         "amount": 0.5,
         "name": "cup brown sugar (topping)"
      },
      {
         "amount": 5,
         "name": "(5-7) pineapple rings drained and juice reserved (topping)"
      },
      {
         "amount": 0,
         "name": "Maraschino cherries without stems (topping)"
      },
      {
         "amount": 3,
         "name": "tbsp vegetable oil (cake)"
      },
      {
         "amount": 0.75,
         "name": "cup granulated sugar (cake)"
      },
      {
         "amount": 1,
         "name": "large egg (cake)"
      },
      {
         "amount": 0.5,
         "name": "large egg (cake)"
      },
      {
         "amount": 2,
         "name": "tsp salt (cake)"
      },
      {
         "amount": 2,
         "name": "tsp baking powder (cake)"
      },
      {
         "amount": 7,
         "name": "tsp vanilla extract (cake)"
      },
      {
         "amount": 1.33,
         "name": "cups all-purpose flour (cake)"
      },
      {
         "amount": 0.25,
         "name": "cup full-fat sour cream or Greek yogurt (cake)"
      },
      {
         "amount": 0.5,
         "name": "cup milk (cake)"
      },
      {
         "amount": 0.25,
         "name": "cup pineapple juice (cake)"
      }
   ],
   "instructions": "**Note, ingredients need to be at room temperature for best results**\n\nSara's Cheesecake Directions:\nPreheat oven 325 degrees. Grease a 9” spring-form pan (bottom & sides) with Pam spray. Boil water (for water bath).\n\n1. In medium bowl, mix graham crackers, sugar, and melted butter. Press into the bottom of spring-form pan and bake for 5-10 minutes\n2. In large mixing bowl, beat cream cheese with sugar until smooth. Use wooden spoon to mix in the eggs 1 at a time and % cup milk until just incorporated (Do not over mix). Mix in sour cream, vanilla, and flour until smooth. Pour filling onto prepared crust.\n3. Wrap the bottom of the spring-form pan with 2 sheets of tin foil to prevent water from penetrating crust/cake. Place spring-form pan into a water bath of boiling water about 17” deep. (I use a roaster pan and sit the cheese cake in it with the hot water)\n4. Bake at 325 degrees for 1-1/2 hours then turn the oven off (do not open oven). Let the cheesecake stand in the oven for 3 hours then remove and refrigerate overnight.\n5. Cheesecake should have pulled away from the edges during baking. Remove spring-form sides. Run knife between crust and bottom of the pan and move cake to serving platter.\n\nThe BEST Pineapple Upside Down Cake Instructions\n\n* Preheat your oven to 350 degrees F. Lightly grease the bottom and sides of a 9 inch round cake pan with cooking spray. In a small bowl, combine the melted butter and brown sugar and pour the mixture into the bottom of the cake pan, spreading it out evenly. Arrange the pineapple rings around the pan and place maraschino cherries in between. Set aside briefly.\n * In the bowl of a stand mixer, cream together the oil and granulated sugar until moistened. Beat in the egg, salt, baking powder, and vanilla until combined. Beat in the sour cream. Gradually add some of the milk, alternating with the flour until a soft batter comes together. Gently beat in the pineapple juice last.\n* Carefully pour the batter over the pineapples in the pan, careful not to disturb their placement. Bake for approx. 40-45 minutes or until the cake appears set, is light golden brown, and a toothpick inserted near the center comes out clean or with moist, not wet, crumbs. Cool for 10-15 minutes, then very carefully invert the cake onto a platter or plate. Serve warm or room temperature.\n\nPineapple Upside-Down Cheesecake Assembly\n1. Invert cakes, one onto a flat surface like a cutting board and the other on the plate you will be presenting on.\n2. Take out the pineapple cheesecake. Trim top of the cheesecake if it is not even. Take it out of the pan and lift it off the bottom carefully, you may need to use a tool like a frosting spatula to help. Place on top of the first cake layer. Trim the sides of the cheesecake with a knife if necessary. Place the second layer of cake on top. Serve as is or with whipped cream, enjoy!",
   "yield": {
      "amount": 18,
      "name": "servings"
   }
}
