{
   "name": "Sponge Cake Roll",
   "author": "Ginny Robert",
   "category": 6,
   "ingredients": [
      {
         "amount": 1,
         "name": "c. confectioners sugar"
      },
      {
         "amount": 1,
         "name": "tsp. vanilla"
      },
      {
         "amount": 0.75,
         "name": "c. all purpose flour"
      },
      {
         "amount": 1.5,
         "name": "tsp. cream of tartar"
      },
      {
         "amount": 6,
         "name": "eggs separated"
      },
      {
         "amount": 0.25,
         "name": "tsp. salt"
      }
   ],
   "instructions": "Lightly grease 15 1/2 x 10 1/2 x 1 inch jelly roll pan. Line bottom with waxed paper and grease again. Set aside. In mixing bowl beat egg whites, cream of tartar and salt at high speed until stiff but not dry, just until whites no longer slip when bowl is tilted. In large bowl, beat egg yolks at high speed until thick and lemon-colored, about 5 minutes. Gradually beat in confectioners sugar and vanilla. Gently but thoroughly fold flour and whites into yolk mixture. Pour into prepared pan, spreading evenly. Bake in preheated 400° oven until top of cake springs back when touched lightly with finger 10 to 12 minutes. Cover a clean towel with waxed paper. Sprinkle paper lightly with confectioners sugar. Loosen cake from sides of pan with spatula and invert onto prepared towel. Carefully pull waxed paper off bottom of cake and discard. Trim all edges. Starting from narrow edge, roll up cake, rolling sugared waxed paper in with cake. Wrap in towel and place seam-side down on wire rack until cool, about 30 minutes. To prepare cake roll, carefully unroll cake and spread with whipped cream, jelly or other filling. Reroll. Place on serving plate. Chill. Just before serving dust with confectioners sugar, if desired. Chocolate Sponge Roll: Combine 4 cup cocoa with 1 cup confectioners sugar. Add to beaten egg yolks and proceed as directed above. Note: If prepared in advance, cake may be frozen without filling. Wrap well with aluminum foil or plastic wrap. To thaw, let wrapped cake stand at room temperature 1 hour.",
   "yield": {
      "amount": 0,
      "name": ""
   }
}
