{
   "name": "Caramels",
   "author": "Shirley Drury",
   "category": 6,
   "ingredients": [
      {
         "amount": 2,
         "name": "c. granulated sugar"
      },
      {
         "amount": 1,
         "name": "c. light corn syrup"
      },
      {
         "amount": 2,
         "name": "c. half and half dairy cream"
      },
      {
         "amount": 0.5,
         "name": "c. nulomoline"
      },
      {
         "amount": 0.5,
         "name": "tsp. lecithin"
      },
      {
         "amount": 0.0625,
         "name": "lb. butter"
      },
      {
         "amount": 0.5,
         "name": "tsp. salt"
      },
      {
         "amount": 1,
         "name": "tsp. vanilla extract"
      }
   ],
   "instructions": "In a 3-quart heavy saucepan, cook sugar, corn syrup, Nulomoline, dairy cream and lecithin. Stir often at the beginning to dissolve the sugar before reaching the boiling point. Bring to a boil on medium to high heat and let cook for about three minutes; add broken pieces of butter and continue to cook on medium to high heat. When temperature reaches 230°, turn heat to medium and begin to stir mixture with a wooden spoon and continue to stir with a steady, even motion until temperature reaches 246°. Remove from heat and add salt and vanilla, and mix gently with a wooden spoon. If nut caramels are desired, add broken pecan pieces at this point and mix in. Chocolate caramels can also be made by mixing in two squares of melted bitter baking chocolate at this stage. Caramel mixture can now be poured onto a cool, well buttered or oiled marble surface, framing the caramel with steel bars which have also been buttered or oiled on the side which comes in contact with the hot caramel; or into a well buttered or oiled square or rectangular pan, and placed in a cool place until firm enough to cut. Caramel should be cut into pieces about 3/4 inch square, and either wrapped in wax paper or dipped in chocolate or pastel coating.",
   "yield": {
      "amount": 0,
      "name": ""
   }
}
