{
   "name": "Hostess Cupcakes",
   "author": "",
   "category": 6,
   "ingredients": [
      {
         "amount": 24,
         "name": "paper liners (cupcake)"
      },
      {
         "amount": 1,
         "name": "pkg (18.25oz) chocolate cake mix with puddig (cupcake)"
      },
      {
         "amount": 1,
         "name": "cup sour cream (cupcake)"
      },
      {
         "amount": 0.75,
         "name": "cup water (cupcake)"
      },
      {
         "amount": 0.5,
         "name": "cup vegetable oil (cupcake)"
      },
      {
         "amount": 3,
         "name": "large eggs (cupcake)"
      },
      {
         "amount": 1,
         "name": "tsp vanilla (cupcake)"
      },
      {
         "amount": 4,
         "name": "oz. frozen whipped topping - thawed but stll cold (filling)"
      },
      {
         "amount": 0.5,
         "name": "cup sour cream - cold (filling)"
      },
      {
         "amount": 0.5,
         "name": "cup sifted powder sugar (filling)"
      },
      {
         "amount": 0.5,
         "name": "tsp vanilla (filling)"
      },
      {
         "amount": 6,
         "name": "tbsp (3/4 stick) butter (frosting)"
      },
      {
         "amount": 0.25,
         "name": "cup un-sweet cocoa powder (frosting)"
      },
      {
         "amount": 0.25,
         "name": "cup milk (frosting)"
      },
      {
         "amount": 2.75,
         "name": "cup sifted powder sugar (frosting)"
      },
      {
         "amount": 2,
         "name": ""
      },
      {
         "amount": 3,
         "name": ""
      }
   ],
   "instructions": "To Make Cake:\n\nPlace a rack in center of over and pre-heat to 350 degrees. Line 24 cupcakes with paper and set aside. Place cake mix, sour cream, water, oil, eggs, & vanilla in large bowl. Beat on low speed for 1 minute. Scrape bowl, increase speed to medium and beat for 2 minutes. Scoop batter into cupcake liners 2/3rds of the way full. Please pan in oven and bake until tops spring back when lightly pressed with finger (16-20 minutes). Remove from oven and place on cooling rack for 5 minutes. Remove cupcakes from pan & put on cooling rack for another 15 minutes before filling.\n\nTo Make Filling:\n\nPlace whipped topping, sour cream, powdered sugar, & vanilla in mixing bowl. Beat on medium until smooth. Put bowl in refrigerator until cupcakes are completely cooled. — Once cupcakes are cooled, put filling into an icing bag with large hole tip. Poke hole in center of cupcake with tip and squeeze about 2 TBL of filling into cupcakes. Place cupcakes in refrigerator to chill while making frosting.\n\nTo Make Frosting:\n\nMelt butter in medium sized pan on low heat for 2-3 minutes. Stir in cocoa and milk. Cook, stirring until thicken and just begins to boil. Remove from heat, stir in powdered sugar, adding more if needed, until frosting is thickened and smooth and is the consistency of a hot fudge sauce. Ladle frosting over cooled cake and spread. Icing will harden as it cools. Use white icing & small tip to make squiggly line in center of cupcake.",
   "yield": {
      "amount": 0,
      "name": ""
   }
}
