{
   "name": "Bread Pudding with Southern Bourbon Sauce",
   "author": "Barbara Garett - foodnetwork.com",
   "category": 6,
   "ingredients": [
      {
         "amount": 3,
         "name": "cups stale French bread, cut in 3/4-inch cubes"
      },
      {
         "amount": 2,
         "name": "cups milk"
      },
      {
         "amount": 2,
         "name": "eggs"
      },
      {
         "amount": 1,
         "name": "cup sugar"
      },
      {
         "amount": 1,
         "name": "tbsp vanilla extract"
      },
      {
         "amount": 0.5,
         "name": "tsp cinnamon"
      },
      {
         "amount": 0.25,
         "name": "tsp nutmeg"
      },
      {
         "amount": 4,
         "name": "tbsp butter, melted and slightly cooled"
      },
      {
         "amount": 0.5,
         "name": "cup sultana raisins - optional"
      },
      {
         "amount": 2,
         "name": "eggs yolks (bourbon sauce)"
      },
      {
         "amount": 1,
         "name": "stick butter, not margarine (bourbon sauce)"
      },
      {
         "amount": 1,
         "name": "cup sugar (bourbon sauce)"
      },
      {
         "amount": 0.33,
         "name": "cup bourbon whiskey, to taste (Use Armaretto instead of Bourbon) (sauce)"
      }
   ],
   "instructions": "Prep: 25 min\nCook: 50 min\n\nDirections\n\nPreheat oven to 350 degrees F.\n\nPlace stale bread in a bowl with milk and squeeze the bread with your hand until well saturated with milk.\n\nWith an electric mixer on high speed in a separate bowl, beat eggs with sugar until thick and pale. Stir in the vanilla, cinnamon, nutmeg, butter and raisins to the egg mixture. Add the soaked bread crumbs to the egg mixture and stir well. Let stand for 10 minutes. It is important to allow enough time for the bread to absorb the egg mixture or the bread crumbs will fioat to the top during baking, leaving a layer of custard on the bottom of the dish.\n\nTransfer the mixture to a greased baking dish. Bake until firm, or until a knife inserted in the middle comes out clean, about 45 to 50 minutes. Let it slightly cool in the dish.\n\nBourbon Sauce:\nMeanwhile, near the end of the baking time, make the saucs. With an electric mixer, beat egg yolks until thick and pale. In a saucepan, meit the butter and sugar. Pour the butter and sugar mixture over the egg yolks, beating constantly with the mixer, until well thickened. Stir in bourbon by hand. Serve the pudding warm with vanilla ice cream if desired. Pass the hot bourbon sauce separately.",
   "yield": {
      "amount": 0,
      "name": ""
   }
}
