{
   "name": "Honey Garlic Pork Tenderloin",
   "author": "Ashley Fehr - thereciperebel.com",
   "category": 3,
   "ingredients": [
      {
         "amount": 2,
         "name": "pork tenderloins (trimmed - 1-1.25 lbs each, about 2-2.5 lbs total)"
      },
      {
         "amount": 1,
         "name": "tablespoon oil"
      },
      {
         "amount": 0.5,
         "name": "teaspoon seasoning salt"
      },
      {
         "amount": 0.66,
         "name": "cup clear honey"
      },
      {
         "amount": 0.25,
         "name": "cup low sodium chicken broth (or sub water)"
      },
      {
         "amount": 2,
         "name": "tablespoons low sodium soy sauce"
      },
      {
         "amount": 2,
         "name": "tablespoons minced garlic"
      },
      {
         "amount": 1,
         "name": "tablespoon apple cider vinegar"
      },
      {
         "amount": 0.25,
         "name": "teaspoon salt"
      },
      {
         "amount": 1.5,
         "name": "tablespoons corn starch"
      },
      {
         "amount": 0.125,
         "name": "(0.125-0.25) red pepper flakes (optional - highly recommended!)"
      }
   ],
   "instructions": "Instructions\n1. Preheat the oven to 400 degrees F and lightly grease a 9x13 inch baking dish.\n\n2. Place tenderloins in baking dish, brush with oil and season all over with seasoning salt.\n3. Whisk together honey, broth, soy sauce, garlic, vinegar, salt, com starch and red pepper flakes.\n4. Pour sauce around pork tenderloin in pan -- avoid pouring on top of pork as it will prevent it from browning.\n5. Bake, uncovered, for 15-20 minutes until a meat thermometer reads at least 140 degrees F.\nRemove from the oven and cover to rest for 10 minutes.\n6. Slice pork tenderloin and serve with sauce.\n\nNotes\nTips:\n* Size matters: this recipe will not work with a pork loin which is much larger and requires a longer cook time. In the time it takes the loin to cook, the sauce will burn. If your tenderloins are larger than 1.25 pounds each, you may want to add the sauce for the last 15-20 minutes of cook time.\n* Check the temp. As always, the best way to tell that meat is done is to use a meat thermometer. Pork chops should be 140-145F!\n* Don't over-cook. Since pork is a lean meat, it can dry out more easily than other types of meat. Be sure to take it out of the oven as soon as possible after it reaches 140-145°F\n* Let it rest. Resting the meat for 10 minutes before slicing into it is the key to juicy pork.\n\nSubstitutions:\n* Slow cooker: you can make this recipe in the slow cooker! Simply add the tenderloins and sauce and cook on low for 3 hours or until done.\n* Pork loin: I don't recommend pork loin for this recipe because they are so much larger and require so much more bake time. If you want to serve the sauce with a pork loin you are cooking, simply simmer it on the stove top until thickened.",
   "yield": {
      "amount": 0,
      "name": ""
   }
}
