{
   "name": "Warm Molten Lava Cake",
   "author": "Sara Snider",
   "category": 6,
   "ingredients": [
      {
         "amount": 4,
         "name": "tbsp unsalted butter, room temperature, plus more for muffin tins"
      },
      {
         "amount": 0.33,
         "name": "cup granulated sugar, plus more for muffin tins"
      },
      {
         "amount": 3,
         "name": "large eggs"
      },
      {
         "amount": 0.33,
         "name": "cup all-purpose flour"
      },
      {
         "amount": 0.25,
         "name": "teaspoon salt"
      },
      {
         "amount": 8,
         "name": "ounces bittersweet or semi-sweet chocolate, melted"
      },
      {
         "amount": 0,
         "name": "Confectioners' sugar, for dusting"
      },
      {
         "amount": 0,
         "name": "Whipped Cream or vanilla lce cream"
      }
   ],
   "instructions": "",
   "yield": {
      "amount": 0,
      "name": "Directions:\n\n1)Preheat oven to 400 degrees. Generously butter 6 cups of a standard muffin tin (or 12 smaller cupcake pan - but again you'll have to reduce the timing). Dust with granulated sugar, and tap out excess. Set aside.\n\n2)In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and granulated sugar until fluffy. Add eggs one at a time, beating well after each addition. With the mixer on low speed, beat in flour and salt until just combined. Beat in chocolate until just combined. Divide batter evenly among prepared muffin cups.\n\n3)Place muffin tin on a baking sheet; bake just until tops of the cakes no longer jiggle when the pan is lightly shaken, 8 to 10 minutes (less for mini ones around 5-6 minutes). Remove from oven; let stand 10 minutes.\n\n4)To serve, turn out cakes, and place on serving plates, bottom sides up. Dust with confectioners’ sugar, and serve with whipped cream (Or vanilla ice cream), if desired (Trust me you will desire it once you break into the yummy warm luscious lava cake and the chocolaty goodness oozes out)."
   }
}
