{
   "name": "The BEST Pineapple Upside Down Cake",
   "author": "Hayley Parker - thedomesticrebel.com",
   "category": 6,
   "ingredients": [
      {
         "amount": 0.25,
         "name": "cup salted butter melted (topping)"
      },
      {
         "amount": 0.5,
         "name": "cup brown sugar (topping)"
      },
      {
         "amount": 5,
         "name": "(5-7) pineapple rings drained and juice reserved (topping)"
      },
      {
         "amount": 0,
         "name": "Maraschino cherries without stems (topping)"
      },
      {
         "amount": 3,
         "name": "tbsp vegetable oil (cake)"
      },
      {
         "amount": 0.75,
         "name": "cup granulated sugar (cake)"
      },
      {
         "amount": 1,
         "name": "large egg (cake)"
      },
      {
         "amount": 0.5,
         "name": "large egg (cake)"
      },
      {
         "amount": 2,
         "name": "tsp salt (cake)"
      },
      {
         "amount": 2,
         "name": "tsp baking powder (cake)"
      },
      {
         "amount": 7,
         "name": "tsp vanilla extract (cake)"
      },
      {
         "amount": 1.33,
         "name": "cups all-purpose flour (cake)"
      },
      {
         "amount": 0.25,
         "name": "cup full-fat sour cream or Greek yogurt (cake)"
      },
      {
         "amount": 0.5,
         "name": "cup milk (cake)"
      },
      {
         "amount": 0.25,
         "name": "cup pineapple juice (cake)"
      }
   ],
   "instructions": "Prep Time: 10 mins\nCook Time: 45 mins\n\nInstructions\n\n* Preheat your oven to 350 degrees F. Lightly grease the bottom and sides of a 9 inch round cake pan with cooking spray. In a small bowl, combine the melted butter and brown sugar and pour the mixture into the bottom of the cake pan, spreading it out evenly. Arrange the pineapple rings around the pan and place maraschino cherries in between. Set aside briefly.\n * In the bowl of a stand mixer, cream together the oil and granulated sugar until moistened. Beat in the egg, salt, baking powder, and vanilla until combined. Beat in the sour cream. Gradually add some of the milk, alternating with the flour until a soft batter comes together. Gently beat in the pineapple juice last.\n* Carefully pour the batter over the pineapples in the pan, careful not to disturb their placement. Bake for approx. 40-45 minutes or until the cake appears set, is light golden brown, and a toothpick inserted near the center comes out clean or with moist, not wet, crumbs. Cool for 10-15 minutes, then very carefully invert the cake onto a platter or plate. Serve warm or room temperature.",
   "yield": {
      "amount": 8,
      "name": "(8-10)"
   }
}
