{
   "name": "Pineapple Upside Down Cheesecake",
   "author": "Dana - ThisSillyGirlsLife.com",
   "category": 6,
   "ingredients": [
      {
         "amount": 4,
         "name": "(8 oz) packages cream cheese room temp (cheesecake)"
      },
      {
         "amount": 1.5,
         "name": "cup granulated sugar (cheesecake)"
      },
      {
         "amount": 0.75,
         "name": "cup milks (cheesecake)"
      },
      {
         "amount": 4,
         "name": "eggs (cheesecake)"
      },
      {
         "amount": 1,
         "name": "cup sour cream (cheesecake)"
      },
      {
         "amount": 1, 
         "name": "tbsp vanilla bean paste or extract (cheesecake)"
      },
      {
         "amount": 0.25,
         "name": "cup all purpose flour (cheesecake)"
      },
      {
         "amount": 0.33,
         "name": "cup pineapple juice (cheesecake)"
      },
      {
         "amount": 0.5,
         "name": "cup unsalted butter melted (topping)"
      },
      {
         "amount": 1,
         "name": "cup packed light brown sugar (topping)"
      },
      {
         "amount": 14,
         "name": "slices canned or fresh pineapple rings (topping)"
      },
      {
         "amount": 14,
         "name": "maraschino cherries (topping)"
      },
      {
         "amount": 3.33,
         "name": "cup all purpose flour sifted (cake batter)"
      },
      {
         "amount": 1,
         "name": "tsp baking powder (cake batter)"
      },
      {
         "amount": 0.5,
         "name": "tsp baking soda (cake batter)"
      },
      {
         "amount": 1,
         "name": "tsp salt (cake batter)"
      },
      {
         "amount": 1,
         "name": "cup unsalted butter melted (cake batter)"
      },
      {
         "amount": 1.5,
         "name": "cup light brown sugar packed (cake batter)"
      },
      {
         "amount": 0.5,
         "name": "cup granulated sugar (cake batter)"
      },
      {
         "amount": 2,
         "name": "eggs (cake batter)"
      },
      {
         "amount": 0.5,
         "name": "cup sour cream (cake batter)"
      },
      {
         "amount": 1,
         "name": "cup milk (cake batter)"
      },
      {
         "amount": 0.5,
         "name": "cup pineapple juice (cake batter)"
      },
      {
         "amount": 2,
         "name": "tbsp vanilla bean paste or extract (cake batter)"
      }
   ],
   "instructions": "Instructions\n\nPineapple Cheesecake\n1. Preheat oven to 350 degrees. Grease a 9-inch springform pan. Cream the cream cheese with the sugar until smooth in a large bowl. Mix in the milk fully then add in one egg at a time and mix. Add in the remaining ingredients and mix until smooth with no lumps.\n2. Pour into the pan and bake for 1 hour, the center will be slightly jiggly. Shut off oven and let cool down in the oven for 5 hours. Top with plastic wrap and place in fridge overnight to get cold.\n\nPineapple Upside-Down Cake\n1. Start with the topping by dividing the melted butter equally between two 9 inch cake pans. Sprinkle 1/2 Cup of the brown sugar into each pan. Arrange the pineapple slices and cherries as pictured, set aside.\n2. Preparing and cooking the cake: Preheat oven to 350 degrees. In a large bowl, add in the sifted flour, baking powder, baking soda, and salt, whisk to combine.\n3. In a medium-sized bowl, add in the 1 Cup melted butter, brown sugar, and granulated sugar. Whisk to combine, getting all the brown sugar lumps broken up. Whisk in the eggs, sour cream, milk, pineapple juice and vanilla until combined.\n4. Add the wet mixture to the dry mixtures and mix until combined, with no dry spots or lumps.\n5. Evenly divide the batter between the two pans, about 2/3 of the way full, do not overfill!\n6. Line oven with foil or two cookie sheets, cakes may bubble over some. Bake for 48-53 minutes, covering loosely with foil at the 20-minute mark to avoid burning. Cakes are down when a toothpick inserted in the middle comes out clean.\n7. Place cakes on a wired rack to cool for 10 minutes.\n\nPineapple Upside-Down Cheesecake Assembly\n1. Invert cakes, one onto a flat surface like a cutting board and the other on the plate you will be presenting on.\n2. Take out the pineapple cheesecake. Trim top of the cheesecake if it is not even. Take it out of the pan and lift it off the bottom carefully, you may need to use a tool like a frosting spatula to help. Place on top of the first cake layer. Trim the sides of the cheesecake with a knife if necessary. Place the second layer of cake on top. Serve as is or with whipped cream, enjoy!",
   "yield": {
      "amount": 18,
      "name": "servings"
   }
}
